Revit 2027 API
PolyLine.NumberOfCoordinates Property
Gets the number of the coordinate points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfCoordinates { get; }
Public ReadOnly Property NumberOfCoordinates As Integer
	Get
public:
property int NumberOfCoordinates {
	int get ();
}
member NumberOfCoordinates : int with get
Property Value
Int32
See Also
Reference
PolyLine Class
Autodesk.Revit.DB Namespace